---
kind: other
id: Properties.T:Autodesk.Revit.DB.RoutingPreferenceManager
source: html/40269726-6e76-cdb0-196a-56925d5b2214.htm
---
# RoutingPreferenceManager Properties

Specifies whether the .NET object represents a valid Revit entity.